{
    "sessions": [
        {
            "speaker": "Angie Jones",
            "bio": "Angie Jones is the Global Vice President of Developer Relations for Block’s decentralized finance division. She is an award-winning teacher and international keynote speaker who shares her wealth of knowledge at software companies and conferences all over the world. As a Master Inventor, Angie is known for her innovative and out-of-the-box thinking style which has resulted in more than 25 patented inventions in the areas of metaverses, collaboration software, social networking, smarter planet, and software development processes.",
            "title": "The Reality of Testing in an Artificial World",
            "abstract": "Our world is changing. Artificial intelligence is being employed in just about all walks of life - from virtual assistants to self-driving cars. How does this new way of life impact software testing? What is our role...is there even one?\n\nOf course there is! While the future of artificial intelligence is mostly unknown, remember that as testers, one of our strongest assets is being able to discover and report the unknown. Many software developers jump at the opportunity to learn and implement the new skills required for artificial intelligence. Let’s get on board and take our place in making history!\n\nIn this talk, Angie Jones will share her personal journey in learning how to test AI-based applications, her views on the tester’s role in an artificial world, the skills needed to test such applications, and the impact that a tester can make in this space.\n\nKey Takeaways:\n- You will gain a better understanding of the testable features of AI\n- You will examine the skills needed to test AI\n- You will explore the impact that testers can have on developing AI applications",
            "time": "8:00 - 9:00",
            "room": "East Ballroom",
            "picture": "",
            "website": "https://angiejones.tech/",
            "linkedin": "https://www.linkedin.com/in/angiejones/",
            "twitter": "https://twitter.com/techgirl1908",
            "youtube": "https://www.youtube.com/user/angieluvboo/featured"
        },
        {
            "speaker": "Melissa Tondi",
            "bio": "Melissa Tondi has spent most of her career working within software testing teams. She is the Director of Quality Engineering at Guild Education and Principal at Disrupt Testing, where she assists companies to continuously improve the pursuit of quality software—from design to delivery and everything in between. In her software test and quality engineering careers, Melissa has focused on building and organizing teams around three major tenets—efficiency, innovation, and culture – and uses the Greatest Common Denominator (GCD) approach for determining ways in which team members can assess, implement and report on day to day activities so the gap between need and value is as small as possible.",
            "title": "The Lazy Tester: Musings on being Efficient",
            "abstract": "Melissa will share her experiences on unique ways to be efficient in testing, within teams and life in general. She will weave together stories that will correlate a new way to think about our profession in a lighthearted and informative way.",
            "time": "4:15 - 5:15",
            "room": "East Ballroom",
            "picture": "",
            "website": "http://melissatondi.blogspot.com/",
            "linkedin": "https://www.linkedin.com/in/melissa-tondi-186551/",
            "twitter": "https://twitter.com/melissatondi"
        },
        {
            "speaker": "Alexa Beach",
            "bio": "Alexa Beach is a Senior Quality Assurance Analyst for Core BTS. Alexa has over 8 years of experience in advocating for quality throughout various projects. She is passionate about not only testing functionality, but also testing from the perspective of the end-user. Because of her strong belief that testing should be approached as early in the process as possible, she engages in quality advocacy at every stage of the project, from designing the user interface to uncovering and documenting business  requirements. Please don’t throw something over the wall at her. When she is not working, Alexa enjoys spending time with her family at their lake place or a nearby local winery. If you don’t find her there, she is probably at home snuggled up with her pup and a cup of coffee.",
            "title": "Shifting our mindset from Quality Assurance to Quality Advocacy",
            "abstract": "While assuring quality is a necessary step for project success, true impact can only be achieved through advocating quality. Sure, we can follow the typical QA model and just stop bugs from happening at the end, OR we can advocate for quality at all stages of a project in order to outperform and transform!\n\nEnsuring the quality of a product is difficult to do if you only begin to worry about it at the end of a project, and yet the QA role that is tasked with ensuring quality is traditionally treated as the last stop for development. Instead, it is better for QA to be involved in advocating for the quality of the product from the very first stages. What does quality advocacy look like? How do you implement it and continue to engage with all factors of discovery and development throughout the duration of a project? Finally, what are the benefits of having quality advocacy as opposed to traditional quality assurance? Quality Assurance is a team effort; therefore strong relationships between Quality Assurance Analysts and Developers are vital.",
            "time": "12:45 - 1:45",
            "room": "Cartoon Room",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/alexa-beach-3152b012b/",
            "twitter": ""
        },        
        {
            "speaker": "Aly Brine",
            "bio": "Aly Brine is the founder of The Corporate Hippie Hustle, the leading resource for Corporate Hippies who want to thrive in their careers. As someone who loves juxtaposition, her work focuses on teaching both energetic and practical tools to equip her fellow lightworkers in purposeful work. Aly prides herself on embracing her awareness that effective transformation starts from within and exudes a talent to problem solve from multiple lenses while questioning the norms of work in a manner that’s backed by business acumen. She’s an award-winning coach, speaker, and podcast host with a background in Human Resources, collegiate career services and recruiting.\n\nAly comes with a Master’s in Human Resources Management and Bachelor’s in Psychology both from The Ohio State University, a yoga instruction certification and more professional development coursework than most humans should probably do in a lifetime. And if you were wondering: Enneagram 3, Scorpio Sun, Leo Moon, Taurus Rising and Manifesting Generator Human Design. She’s got crystals in her Louis Vuitton and is just as comfortable in a full moon circle as she is in a meeting with the leadership team. At the end of the day, she considers herself a little corporate, a little hippie and a lotta hustle.",
            "title": "LinkedIn: No Longer a Place Your Resume Goes to Die",
            "abstract": "LinkedIn is no longer a place where your resume goes to die only to be revived if you need to land a new job. The leading online professional network boasts over 700 million users from every industry, meaning, no matter what you're looking to accomplish in your career, you can find a LinkedIn connection willing to help! But with dozens of social media platforms each having their own nuances of how to act, what to post and who to be, feeling comfortable using LinkedIn can be a bit overwhelming. In this session, you'll learn everything you need to know to use LinkedIn to connect with fellow professionals. From optimizing your profile to the settings you need to change in order to ensure your profile is being seen along with how to identify the decision makers and most importantly, how to turn those connections into genuine relationships and walk away with a refreshed and optimized LinkedIn profile. We may be living in a virtual world but using LinkedIn to create relationships will take your career to the next level.",
            "time": "3:05 - 4:05",
            "room": "Great Hall 3",
            "picture": "",
            "website": "https://www.alybrine.com/",
            "linkedin": "https://www.linkedin.com/in/alybrine/",
            "twitter": ""
        },
        {
            "speaker": "Amanda Perkins",
            "bio": "Amanda Perkins is a Sr. SQA for Rocket Homes. She has been in the quality field for almost 10 years and uses her vast array of job skills to help improve not only the quality of software but the quality of interactions between team members. With a background in customer service, retail sales, music and leadership, she uses these skills to help her to think outside of the box when it comes to quality. With a passion for software quality and strengthening soft skills for members in IT, she is a speaker and has given conference talks on building more inclusive teams, tips and tricks on how to give better demos, and is working toward giving other talks on automation frameworks and the human side of software testing. Amanda lives near Kansas City, MO with her husband, 2 kids, cat and dog.",
            "title": "The Human Side to Testing",
            "abstract": "As testers, we are known for breaking things and testing the limits, and patience, of our team and our systems. We advocate for quality in all things and we advocate for the end user. We push our teams to be more quality focused and to do what is functional but also good for a user. But, none of us actually think about how our varied backgrounds influence what we do and how we test. In this session we will explore how our previous (and current) experiences subconsciously affect our testing and how to bring those experiences to the forefront in order to be better testers all around. We’ll discuss how experiences we’ve had, both current and previous, affect how and what we test. By recognizing that our individual life experiences flavor the way we test and interact, we can be better testers and teammembers. Attendees will see how their varied backgrounds influence their testing and make them better testers.",
            "time": "10:30 - 11:30",
            "room": "Great Hall 3",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/amanda-perkins-bbaa3020/",
            "twitter": "https://twitter.com/theqadiva"
        },
        {
            "speaker": "Andrew Knight",
            "bio": "Andrew Knight is the Automation Panda and a Developer Advocate at Applitools. He strives to help others in solving problems in software development, testing, and quality. Over the past decade, he has designed and built robust test automation projects from the ground up that can run thousands of tests continuously. He is the author of the upcoming book \"The Way To Test Software\" from Manning Publications, and he is also the lead developer for Boa Constrictor, the .NET Screenplay Pattern. Read his tech blog at AutomationPanda.com, and follow him on Twitter at @AutomationPanda.",
            "title": "Open Testing: Opening Tests like Opening Source",
            "abstract": "Testing is a vibrant discipline with well-established practices, but many times, nobody but the testers who write the tests ever see them. Tests could offer so much value if they were openly shared—with developers, product owners, and perhaps even end-users. So, why don’t we open our tests like we open our source? There are so many parallel benefits: helping others learn, helping teams develop higher-quality software, and helping users gain confidence in the products they use. Opening tests includes sharing the tools, frameworks, and even test cases themselves. With AI and ML technologies, we could even build a future where generic open tests for common behaviors could run on any kind of app. In this keynote, we will look at ways a team could be more open about testing. Not every team may be able to publicly publish their tests, but any team could still benefit from the openings that shift-left practices can bring. Open Testing could be revolutionary. Let’s make it a reality!",
            "time": "12:45 - 1:45",
            "room": "West Ballroom",
            "website": "https://automationpanda.com/",
            "linkedin": "https://www.linkedin.com/in/andrew-leland-knight/",
            "twitter": "https://twitter.com/AutomationPanda"
        },
        {
            "speaker": "Andy Warns",
            "speaker2": "Jacob Hanning",
            "bio": "Andy Warns is the Principal Automation Architect at Impower.ai. A subject matter expert in process and test automation, continuous integration/delivery, and enterprise architecture, he focuses on partnering with leadership to strategize, architect and implement automation solutions with the goal of driving efficiency gains throughout the entire organization.",
            "bio2": "Coming Soon",
            "title": "Hyperautomation – The New Era of Digital Transformation",
            "abstract": "QA Automation has always been a strategy that when successfully implemented enables organizations to improve software quality while releasing more frequently. Roughly a year ago a new concept emerged from Gartner as the leading technology trend for 2020, “Hyperautomation”. Hyperautomation is the concept of automating everything in an organization that can be automated utilizing QA Automation, Robotic Process Automation, and Machine Learning / AI. Come discover how you can digitally transform your organization enabling the fully automated enterprise.",
            "time": "9:15 - 10:15",
            "room": "Interfaith Room",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/andy-warns-8a512b30/",
            "twitter": "",
            "linkedin2": "",
            "twitter2": "",
            "website2": "",
            "youtube2": ""
        },
        {
            "speaker": "Ben Oconis",
            "bio": "Ben Oconis comes from a customer support background where he has spent 15 years managing customers, dealing with angry people, and helping make their day to day experience better. As a new tester—and the first within his organization, Ben takes that background and previous experience and tries to apply it to find innovative ways to help improve quality across the organization. He has had some great successes and failures and hopes to share those with the testing community. When not testing, Ben enjoys hanging with his family which includes 2 kiddos, a 5-year-old and 8-month-old, his wife and his old dog Dexter, who is a dachshund mix.",
            "title": "Ensemble Testing: Creating A Mob: A New Tester’s Journey to Getting People Together To Test",
            "abstract": "As someone new to the QA and the testing community, within his organization, Ben was experiencing difficulties testing stemming from communication issues across teams. It felt like he was often the middle-man in a game of telephone between stakeholders, often making it difficult to efficiently manage how they test new features and products. To help address this issue, Ben incorporated ensemble testing into their testing culture. He will focus on what he has found to be the benefits of ensemble testing (such as improved communication and relationships among teams & spreading product knowledge), helpful hints for making sure the sessions go well (such as being prepared ahead of times & following up and using temporary Slack channels as a tool), and his journey of how, as a new tester, he helped his organization leverage ensemble testing to overcome communication difficulties and improve the speed and impact of their testing efforts.",
            "time": "9:15 - 10:15",
            "room": "Cartoon Room",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/ben-oconis-37335849/",
            "twitter": "https://twitter.com/benoconis?lang=en"
        },
        {
            "speaker": "Carlos Kidman",
            "bio": "Carlos Kidman is a Director of Engineering and Test Architect, but was formerly an Engineering Manager at Adobe. He is also an instructor at Test Automation University with courses around architecture, design, and containerization. He is the founder of QA at the Point, which is the Testing and Quality Community in Utah, and does consulting, workshops, and speaking events all over the world. He streams programming and other tech topics on Twitch, has a YouTube channel, builds open source software like Pylenium and PyClinic, and is an ML/AI practitioner. He loves futbol, anime, gaming, and spending time with his wife and kids.",
            "title": "Scale your Testing and Quality with Automation Engineering and ML",
            "abstract": "Many teams and organizations struggle to scale their quality and testing strategies once they reach tens of teams and hundreds of developers and services across their systems. Traditional strategies and techniques, like testing phases and code freezes, do not work at scale and quickly add friction, reduce productivity, and make testing and quality harder.\n\nIn this presentation, we will cover different ideas and strategies to make things like BDD and TDD easier to adopt at the beginning, how to include observability and operability in your definition of quality, and how leveraging ML/AI can augment your devs and testers and reduce risk while accelerating value.\n\nBy the end, you will have some \"low quality\" indicators that you can use to identify patterns and practices that won't scale well. You will have new insights and ideas for how you can set up your teams and strategies for success long term, and you will see tangible, practical examples you can take to your team and company to start this transformation now.",
            "time": "3:05 - 4:05",
            "room": "Great Hall 1 & 2",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/carlos-kidman/",
            "twitter": "https://twitter.com/CarlosKidman",
            "youtube": "https://www.youtube.com/channel/UCNvYBOCETf7MByrYKDTU3fQ"
        },
        {
            "speaker": "Damian Synadinos",
            "bio": "Damian Synadinos helped to “build better software and build software better” through testing for more than 25 years. Now, through his company Ineffable Solutions, he helps “build better people”. Damian is an international speaker and trainer, delivering keynotes, talks, and workshops that are focused on fundamental topics and people-skills, based on real-world experience, and supplemented with deep research. His diverse experience spans many roles, industries, and companies, including CompuServe, NetJets, Abercrombie & Fitch, Nationwide Insurance, and Huntington Bank. Damian also helped organize the \"QA or the Highway\" conference from 2014-2020, has over 10 years of theatrical improv experience, authored and illustrated a children’s book, “Hank and Stella in Something from Nothing” (HankAndStellaBooks.com), and draws strangers for fun (IDrawStrangers.com).",
            "title": "Is This [Joke] Appropriate?",
            "abstract": "\"Don't poke the bear\" is an old saying that usually means \"Don't do things that are likely to cause trouble\".\n\nCan jokes cause trouble? Sometimes. But when, and how can you know?\n\nThis talk intends to address this topic and these questions...and make it all applicable to you and your job.\n\nJoin me as I explore Risk Analysis in a different, fun way!",
            "time": "9:15 - 10:15",
            "room": "West Ballroom",
            "website": "https://www.ineffable-solutions.com/",
            "linkedin": "https://www.linkedin.com/in/damiansynadinos/",
            "twitter": "https://twitter.com/dsynadinos"
        },
        {
            "speaker": "Darrel Farris",
            "bio": "Darrel Farris is a Solutions Engineering Manager at mabl, a low-code, intelligent test automation company. Prior to mabl, he spent much of his career working across a variety of roles within product delivery, often focused on aspects of quality and testing. His diverse technical experience and upbeat personality make him an engaging, compelling coach with a focus on nurturing good testing practices. In his free time, Darrel enjoys papercraft, tinkering with the insides of pianos, photography, and niche fragrances.",
            "title": "What's Next for QA? The Journey to Quality Engineering",
            "abstract": "Trends such as the migration to the Cloud, transition to DevOps, and growing customer expectations have put a spotlight on QA teams. However, our traditional approach to quality assurance silos teams and slows down product velocity. To continue delivering quality software quickly, we as an industry need to adjust our approach to testing by practicing quality engineering. But, how do we get there? In this talk, Darrel will share observations on the industry trends shaping our approach to quality, define quality engineering, share strategies to respond to these trends, and provide a look at how mabl can support your quality journey.",
            "time": "1:55 - 2:55",
            "room": "Great Hall 1 & 2",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/darrelfarris/",
            "twitter": "https://twitter.com/djbfarris"
        },
        {
            "speaker": "Eran Kinsbruner",
            "bio": "Eran Kinsbruner is a bestselling author, TechBeacon Top 30 test automation leader, and the Chief Evangelist and Senior Director at Perforce Software. His published books include the 2016 Amazon bestseller, “The Digital Quality Handbook”, “Continuous Testing for DevOps Professionals”, and “Accelerating Software Quality – ML and AI in the Age of DevOps”, which was named the “Best New Software Testing Book” by Book Authority. With a background of over 21 years’ experience in development and testing at companies such as Sun Microsystems, Neustar, Texas Instruments, General Electric, and more, Eran holds various industry certifications such as ISTQB, CMMI, and others. Eran is a recognized influencer on continuous testing and DevOps thought leadership, an international speaker, blogger, and also a patent-holding inventor (test exclusion automated mechanisms for mobile J2ME testing). Eran is active in the community and can be found across social media and has his own blog http://continuoustesting.dev",
            "title": "How to Make a Market-Driven Decision on Test Automation Frameworks",
            "abstract": "In this rapidly evolving world of app development and testing, how does one pick a test automation framework? Or decide whether to add or switch to a different framework?\n\nIn this session, Eran Kinsbruner, Author and Chief DevOps Evangelist at Perfecto by Perforce, will isolate the many moving parts and show you how to make a market-driven decision that supports your testers and developers. He will walk you through the core changes challenging web & mobile testing right now (from new devices and OSes to market innovations like APKs, PWAs, and more) and then share critical considerations among leading and emerging test automation frameworks.\n\nYou’ll learn:\n- Driving forces that are impacting the mobile & web app landscape.\n- Differences among mobile frameworks: Appium, Espresso, XCUITest, & Flutter\n- Differences among web frameworks: Selenium, Cypress, & PlayWright.\n- How to select the proper framework for your team.\n- When to switch, mix, or remain with your current tech stack.",
            "time": "10:30 - 11:30",
            "room": "West Ballroom",
            "website": "https://continuoustesting.dev/",
            "linkedin": "https://www.linkedin.com/in/eran-kinsbruner-4b47a81/",
            "twitter": "https://twitter.com/ek121268"
        },
        {
            "speaker": "Jacob Haning",
            "bio": "Jacob Haning is the Principal AI Architect at Impower.ai. A subject matter expert in machine learning, Artificial Intelligence (AI), and pure mathematics, he focuses on leading standards and best practices while helping business units deliver true value by identifying, and solving, challenges ideal for machine learning.",
            "title": "Hyperautomation – The New Era of Digital Transformation",
            "abstract": "QA Automation has always been a strategy that when successfully implemented enables organizations to improve software quality while releasing more frequently. Roughly a year ago a new concept emerged from Gartner as the leading technology trend for 2020, “Hyperautomation”. Hyperautomation is the concept of automating everything in an organization that can be automated utilizing QA Automation, Robotic Process Automation, and Machine Learning / AI. Come discover how you can digitally transform your organization enabling the fully automated enterprise.",
            "time": "",
            "room": "",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/jhaning/",
            "twitter": ""
        },
        {
            "speaker": "Jamie Kelley",
            "bio": "Jamie Kelley is 10 year veteran of the Columbus IT Market. He started his journey in automation development out of college. After that he moved into a full stack developer role 5 years. Now he's back in the automation space at Huntington Bank where he helps manage the Automation efforts for one of their business segments.He has often served in leadership roles on any team he has been on. Teaching others and helping build the foundations for success.In his spare time he likes to ballroom dance and do nerdy activities with his friends.",
            "title": "Automation eVALUEation",
            "abstract": "We all know that Automation Testing has been a major enterprise focus for the last 10 years. Often times we spend so much effort getting the automation in progress and being built that we never think how do we get value from those tests.\n\nSo if you ever wondered why do we spend so much money on automation? If you've ever thought about how do these tests benefit us? If automation has just become another checkbox for your teams but doesn't seem to help. This will be the session for you.\n\nWe'll go over what types of Automation Testing there are. How to get the best return on investment for each type. We'll learn what their limitations are. What their strengths are. How judge if your automation is doing what it needs to be doing.\n\nSo at the end of this session you will be better equipped to use automation to fuel your teams' success.",
            "time": "10:30 - 11:30",
            "room": "Interfaith Room",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/jamie-kelley-7ab54736/",
            "twitter": ""
        },
        {
            "speaker": "Jeff Sing",
            "bio": "Jeff Sing is a Quality Leader who has been in the testing industry for over 15 years. During this time, he has built automation frameworks, test strategies, and executed quality initiatives for fields such as medical devices, infrastructure security, web identification, and experimentation and progressive delivery.Jeff has most recently joined Iterable to build out a QA organization and orchestrates Iterable’s quality control plan utilizing a combination of automated testing, implementing QA procedures, and acting as our customer experience champion to ensure Iterable remains the world’s leading customer engagement platform.",
            "title": "Quality Leadership, Testing, and Governance Tactics that Make or Break Your Progressive Delivery System",
            "abstract": "More and more companies are using Progressive Delivery to get all types of changes – new features, configuration changes, bug fixes, and experiments – into production in a safer, faster, and most importantly, a sustainable way.\n\nSoftware companies that shift to Progressive Delivery benefit from low risk releases, faster time to market, higher quality, and in general happier teams. Sounds great right? But what happens when your system isn’t implemented correctly, or worse, tested properly?\n\nThis talk takes you on a journey of why teams use Progressive Delivery, and the path from basic to advanced feature flag usage.\n\nMake sure you build the right product, and build the product right!\n\nHow to decide what testing strategies should be implemented (how to setup your unit test, end to end automation, etc\n\nWhat tactics are most effective for keeping your implementation healthy and effective (feature flag governance!).",
            "time": "12:45 - 1:45",
            "room": "Great Hall 3",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/jeffsing/",
            "twitter": ""
        },
        {
            "speaker": "Jenna Charlton",
            "bio": "Jenna Charlton been a tester for over a decade and focused on web accessibility, usability, test methodologies, and test and agile leadership. My experience in testing runs the gamut from lone tester on a Scrum team to test lead on an enterprise-level project. I'm passionate about helping teams move to a culture of whole team quality and empowering testers to be quality leaders on their teams.",
            "title": "From Fear to Risk: Redefine What Drives Your Enterprise Testing Strategy",
            "abstract": "Many quality engineering leaders say they do risk-based testing, but walking the walk is showing to be more challenging than enterprises realize. Often, quality engineering teams practicing risk-based testing end up testing “everything” because they continue to test from a place of fear as opposed to calculated risk. Others never reassess or renegotiate risk as their application matures. Additionally, sometimes quality engineering teams lack accurate testing data in order to make well-informed decisions.\n\nEnterprise quality engineering leaders must apply a truth-telling question: What motivates your test coverage decisions? Fear or risk?\n\nIn this session we’ll discuss:\n-How quality engineering leaders assess and measure risk\n-The real motivating factors behind test decisions and how to overcome bias created by fear and previous failures\n-How to judge if software quality is “good enough” before a release so that testing does not harm development velocity\n-How to reassess risk by integrating new data",
            "time": "3:05 - 4:05",
            "room": "West Ballroom",
            "website": "https://jenna-tests.proseful.com/",
            "linkedin": "https://www.linkedin.com/in/jbcharlton/",
            "twitter": "https://twitter.com/TheyWrestleTest"
        },
        {
            "speaker": "Joel Montvelisky",
            "bio": "Joel Montvelisky is a Co-Founder and Chief Solution Architect at PractiTest. Joel has been in testing and QA since 1997, working as a tester, QA Manager and Director, and a Consultant for companies in Israel, the US and the EU. Joel is a Forbes council member, a blogger with the QA Intelligence Blog, and is constantly imparting webinars on a number of testing and Quality Related topics. In addition, Joel is the founder and Chair of the OnlineTestConf, and the co-founder of the State of Testing survey and report and a director at the Association of Software Testing(AST).",
            "title": "Align Testing with Business by shifting both Left & Right",
            "abstract": "Agile and DevOps are taking off strongly, because they provide more value to the business aspects of our companies. These revolutionary practices allow testers to help their companies deliver functionality faster, understand how it is being adopted and in turn generate more business revenue. This session will review how techniques such as: User Story Hypothesis Value,\n\nInstrumentation Planning, Behavioral Analysis in Production, and End-to-End metrics help our companies navigate the hypercompetitive business environment we are all a part of.\n\nMain Take-aways:\n- Learn more about the specific role of the testers in the DevOps (r)evolution.\n- Understand the tools the QA team has and how changing the way we test can influence the business\n- Learn useful techniques that testers can use to help the company become more competitive and achieve its goals",
            "time": "1:55 - 2:55",
            "room": "West Ballroom",
            "website": "https://www.practitest.com/",
            "linkedin": "https://www.linkedin.com/in/joelm3/",
            "twitter": "https://twitter.com/joelmonte"
        },
        {
            "speaker": "Justin Hunter",
            "bio": "Justin Hunter is the CEO and Founder of Hexawise, is recognized as one of the world's leading experts in the field of optimized test design. Prior to founding Hexawise, Justin earned an Accenture Global Innovation award for introducing methods of improving the efficiency and effectiveness of software testing. Justin has taught thousands of testers and business analysts on six continents how to implement more efficient and effective testing methods, and is dedicated to furthering the spread of better software test design practices to firms around the world.",
            "title": "Too Much to Test and Not Enough Time? - How to systematically generate the most powerful tests for your needs.",
            "abstract": "Testing managers frequently feel the stress of having too much given the demanding deadlines and strict resource constraints they're operating under. Senior stakeholders ask questions such as:\n- \"How do we know we're executing the RIGHT tests?\"\n- \"How many tests do we need to test this release thoroughly?\"\n- \"What exactly does this test suite cover?\" and\n- \"What things are we NOT covering with our tests?\"\n\nWhen large numbers of tests are selected and documented by hand, clear answers to those straightforward questions are often frustratingly elusive.\n\nThis presentation will describe how proven test generation approaches, while not a \"silver bullet\" to all testing challenges, usually deliver large benefits to:\n- Speed of test selection and test documentation / scripting\n- Creation of objectively better tests (being much more thorough and less wastefully repetitive)\n- Clear communications between teams (around scope and coverage reporting)",
            "time": "9:15 - 10:15",
            "room": "Great Hall 3",
            "website": "https://hexawise.com/",
            "linkedin": "https://www.linkedin.com/in/justinhunter/",
            "twitter": ""
        },
        {
            "speaker": "Leandro Melendez",
            "bio": "Leandro Melendez is a performance testing manager providing testing and consulting services to worldwide companies. He has over 20 years of experience in IT and over 10 in the performance testing practice where he served multiple S&P500 customers all over the USA, Mexico, Canada, Brazil, India, Austria, etc. Author of the popular performance testing blog Señor Performo (www.srperf.com) where he curates a diverse set of learning material for performance testers and engineers. He is the producer and host of the Spanish language version of the PerfBytes podcast and the Señor Performo learning YouTube channels. He is an international public speaker participating in multiple conferences, events and webinars, with keynotes, workshops and multiple talks on his belt. And last, author of \"The Hitchhikers Guide To Load Testing Projects\", a fun walkthrough that will guide you through the phases or levels of an IT load testing project.",
            "title": "Performance and Beyond",
            "abstract": "Performance testing has been moving and jumping around with Site Reliability, SETs, and many new methodologies arising like Agile, DevOps, Scrum Continuous, and many more.\n\nBut sadly not many organizations or professionals have been able to move and evolve with the new set of requirements for the performance engineer.\n\nLearn about why the trade of the performance scripter is dying (or at least diminishing), why it is not suitable anymore for these modern times, and how to tackle the new challenge of not only testing our system's performance... But assuring it!",
            "time": "10:30 - 11:30",
            "room": "Great Hall 1 & 2",
            "website": "http://www.srperf.com/",
            "linkedin": "https://www.linkedin.com/in/leandromelendez/",
            "twitter": "https://twitter.com/SrPerf",
            "youtube": "https://www.youtube.com/channel/UCSd5XYudbkojiPKNNKmma8w"
        },
        {
            "speaker": "Lee Barnes",
            "bio": "Lee Barnes has over 25 years of experience in the Software Quality Assurance and Testing field. Lee has been involved in the implementation of test automation and performance testing solutions in hundreds of environments across a wide array of industries. Most recently, he has been involved with bringing quality practices (with a focus on automation and performance) to DevOps teams. Lee regularly speaks at industry conferences including StarWEST, EuroStar, DevOpsDays, Agile+DevOps East, STPCon, and TestCon Europe.",
            "title": "Continuous Performance Testing in DevOps",
            "abstract": "Performance testing isn’t the first thing organizations think about when moving to DevOps – in fact, it’s often ignored as traditional approaches don’t jive well with the fast and nimble world of DevOps. However, performance is still a critical part of the user experience, and poor performance and outages will quickly negate the value of the features you’re delivering. Lee believes that organizations don’t have to gamble with application performance. He will discuss techniques for implementing continuous performance testing in your pipeline, so you don’t have to roll the dice on your user experience. Topics will include performance testing activities at each stage of the pipeline – from the unit level through testing in production. You will also learn how to rethink your approach to performance testing and work with your DevOps practices instead of against them in areas like test environment and data management. You’ll walk away with a new outlook on performance testing in DevOps and ideas you can begin to implement in your pipeline.",
            "time": "10:30 - 11:30",
            "room": "Cartoon Room",
            "website": "https://utopiasolutions.com/",
            "linkedin": "https://www.linkedin.com/in/leebarnes/",
            "twitter": "https://twitter.com/USI_LeeBarnes"
        },
        {
            "speaker": "Mala Punyani",
            "bio": "Mala Punyani is an Engineering Manager at Splunk with extensive experience in product quality and automation, building enterprise-quality products, and automation solutions. Prior to Splunk, Mala has led innovative test automation projects at enterprise companies including Home Depot, Visa, and Paypal. Mala is a certified PMP and scrum master experienced in coaching and holds graduate degrees in Computer Science and IT Project Management from City University (London) and Stanford University. She currently resides with her family in the SF Bay area.",
            "title": "Why Salesforce Test Automation Shouldn’t Be Painful",
            "abstract": "Today enterprise applications like Salesforce are now at the heart of business processes and 59% of organizations deploy a new software build daily. As quality engineering teams continue to increase investment in test automation of Salesforce applications, new challenges arise in complexity of requirements, ability to scale coverage, and successful implementation across teams to scale.\n\nMala Punyani, Engineering Manager at Splunk was tasked with identifying and implementing an end-to-end testing solution, which would address diverse business needs including API tests, PDF verification for invoicing, ERP system integration, SOQL query validation and running Apex batches. Because UI based automation leads to heavy maintenance, especially after small changes in UI and SFDC screen objects, Mala and her team partnered with their R&D teams to identify a successful automation of their dynamic APIs and test automation practices for their teams and business.\n\nIn this talk, Mala will share a holistic view of the challenges of traditional software testing in the complex Salesforce testing ecosystem and provide a roadmap for leaders to overcome implementation roadblocks in partnership with R&D teams. Finally, Mala will demonstrate how an investment of a DevOps solution with a Sauce Labs integration helped her agile team achieve time reduction of up to 50% for overall flow, while doubling release velocity without additional headcount. If you are a manager looking to scale end-to-end testing coverage and/or wondering how to make your Salesforce test automation less painful, you won’t want to miss this leadership session.",
            "time": "9:15 - 10:15",
            "room": "Great Hall 1 & 2",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/mala-punyani-pmp-csm-b054144/",
            "twitter": ""
        },
        {
            "speaker": "Mohita Prasad",
            "bio": "Mohita Prasad is currently Test Management Lead, at AST. She holds an MBA in Information Technology and Finance, and heads the Testing COE for her organization. Starting off as a tester she has since advanced to become testing lead for multiple projects.",
            "title": "Moving from Isolated Excel-based Testing to an Organization-wide TCoE",
            "abstract": "Join Mohita Prasad for a discussion about her personal journey to create a Testing Center of Excellence (TCOE) for a mid-size consulting firm, AST LLC, a top Oracle partner in the Public Sector. AST has multiple delivery units, where each has its own isolated way of testing. We recognized the need for a better way of test management. We started with a Testing Repository of standardized resources that all delivery units could customize and use for their projects. We migrated from an Excel-based testing approach to one using an ALM (Application Lifecycle Management) solution that is linked to our JIRA issue management system. This approach provides transparency to our clients and to our internal team throughout the testing lifecycle. Our testing process is now uniform across delivery organizations, increasing customer service and satisfaction.",
            "time": "12:45 - 1:45",
            "room": "Interfaith Room",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/mohita-prasad-4a03b718b/",
            "twitter": ""
        },
        {
            "speaker": "Matthew Eakin",
            "bio": "Matthew Eakin has over 20 years of technical, leadership and planning experience. With his extensive experience, Mr. Eakin brings a unique, thorough and comprehensive perspective to every project. His extensive expertise around all aspects of the SDLC combined with development skills has helped him to be an effective Agile and Test practitioner and coach. He talks extensively on Gherkin Scripting and is in high-demand as a BDD (Behavior-Driven Development)/ATDD (Acceptance Test Driven Development) coach.",
            "title": "Building an SDET",
            "abstract": "One of the biggest challenges companies face when they “go agile” is who to task the test automation with? Should it be the testers who have never written a line of code in their life? Should it be the developers who have resisted testing their entire professional career? Should you hire a contractor who hopefully knows what they are doing? Deciding is often the easy part. In this session we will explore the complexities and challenges of what it takes to turn manual testers into respectable Software Developers in the Service of Testing (yes, this is possible), what it takes to make developers respectable Testers (yes, this too is possible), and many options in-between.",
            "time": "1:55 - 2:55",
            "room": "Interfaith Room",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/matthew-eakin-34568ba/",
            "twitter": ""
        },
        {
            "speaker": "Petros Plakogiannis",
            "bio": "Petros Plakogiannis lives in Greece. He has graduated the University of Piraeus and the Technological Educational Institute of Crete. He has been working professionally as a software tester for 12 years, with strong focus on automated testing using various tools like QTP , Selenium, Protractor etc. He also has a significant experience in white box testing, application testing (desktop, web and mobile), and security testing. He travels a lot and support customers onsite by providing information regarding automation testing. Petros is also the main organizer of the Ministry of Testing Athens meetups and he is very active into the testing community.",
            "title": "To BDD or Not to BDD? When the BDD is not used properly.",
            "abstract": "Behavior-driven development attempts to solve the problem of implementing poorly defined requirements. Our client is in chemical Industry. Hence, it was quite difficult for my team to adapt quickly the corresponding business. To be more precise, in order to build the product, we should understand mathematical models, equations and the glossary of chemical terms. BDD was the solution. Management team heard the magic buzzword \"BDD\" and hope that it will solve our challenges. However, nobody follows the principles of BDD and finally BDD became just another \"automation tool\". Business users continued to send documents and emails with the requirements, Developers never used the BDD approach, Analysis team did not follow the patterns to write correct Gherkin syntax as prescribed by the BDD creators etc. The result for the project was just a big mess. In order to address the problems, we had some mini trainings for all our team regarding the correct principles of BDD. We also trained customers with webinars and show them how can write Gherkin files. Also, we have introduced the three amigos concept. Hence, my proposal is this: Do you want to use BDD? Use it right else it will just create more complexity.",
            "time": "1:55 - 2:55",
            "room": "Student Alumni Room",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/petros-plakogiannis/",
            "twitter": "https://mobile.twitter.com/petros_2"
        },
        {
            "speaker": "Robert Fornal",
            "bio": "Robert Fornal is a Senior Solutions Developer with Leading EDJE: Husband, father, and programmer\n\nMy focus is on front-end development:\n- JavaScript\n- CSS\n- SVG\n- AngularJS and Angular\n- React\n- Ionic\n\nRobert says \"Learning from my mistakes over the decades, I feel that I have become a solid programmer.\"",
            "title": "What to Avoid When Writing Unit Tests",
            "abstract": "\"These tests should never have been written. They provide no or little value.\" -ME\n\nTesting code as been described as an \"art form.\" It is, but it should not be. There are many good patterns that should be followed when writing tests. There is even a lifecycle of tests that should be paid some attention. There are also many BAD patterns that developers should be aware of so that they can be avoided (or cleaned up).\n\nThis session will provide a series of examples of bad front-end tests and how to write them correctly.",
            "time": "12:45 - 1:45",
            "room": "Student Alumni Room",
            "website": "https://linqapp.com/conference",
            "linkedin": "https://www.linkedin.com/in/rfornal/",
            "twitter": "https://twitter.com/rfornal"
        },
        {
            "speaker": "Shyam Sunder",
            "bio": "Shyam Sunder is a PMP® Certified Test Program Manager with total IT Testing Experience of 23+ Years. Shyam has worked in various reputed organizations like Capgemini, Dell , Sapient, HCL Tech, United Health Group etc. Shyam is strong in the area of Test Management, Software Testing areas and Client relationship management. Shyam has been a regular contributor in IT Forums with his presentations and workshops. Some of the Conferences include QA Geekle’2021, Q4Quality’2019,TLC’2018,StarEast’2017,STP,2013 etc.\n\nShyam's Professional Certifications:\n- PMI Certified PMP®.\n- Certified Test Manager\n- Certified Scrum Master\n- 6-Sigma Green Belt Champion.\n- KPMG Certified IS0 9001 Internal Auditor.\n- Brainbench Certification in Project Management.\n- AHM 250\n- Healthcare Integration Architect\n- Healthcare Consultant",
            "title": "Legoizing Testing",
            "abstract": "Due to the challenges in capturing the requirements with different teams for our project, we changed our approach on testing so as to align with the overall Project Activation timeline and came up with the Lego Test approach. In Lego Test approach blocks for separate areas are identified. Test Scripts for these blocks are created and executed. This is the new Legoizing Testing approach which we implemented successfully.",
            "time": "9:15 - 10:15",
            "room": "Student Alumni Room",
            "website": "",
            "linkedin": "https://www.linkedin.com/company/wix-com/?trk=public_jobs_topcard_logo&originalSubdomain=il",
            "twitter": ""
        },
        {
            "speaker": "Stacy Wyatt",
            "bio": "Stacy Wyatt started her second career in software and found a love for testing. She started working in QA in 2014 and was placed on the flagship team where one of the first bugs she found was in the code written by the CEO. After learning a lot about testing in an Agile environment, Stacy made the move into Management. She is now Managing the most talented team of SDET's that she's ever worked with!",
            "title": "Our automated journey worked!",
            "abstract": "Six very short months ago, we did not have any automation around big chunks of our product, specifically Salesforce. We set out with a plan to change that! We learned a lot along the way, changed our plans a few times, took drastic measures at others, developed a style guide, changed our development process/culture, and now, we are running a full automated regression suite with every pull request. And if our suite fails, there is no workaround. Everyone stops to understand what caused the fail and fix it.\n\nThis has been a huge change in thinking for everyone, not just QA. Product has to understand our step and that they may not get their feature on their pace. Developers had to tighten up their code so it doesn't immediately fail the first round of testing. And Managers had to step in and help everyone understand the value of this new process.\n\nI cannot be more proud of the work we've done or how my team has stepped up! I want to share this so that others can start making a plan to automate their tests and improve quality in their products!",
            "time": "10:30 - 11:30",
            "room": "Student Alumni Room",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/stacymwyatt/",
            "twitter": "https://twitter.com/stacywyatt"
        },
        {
            "speaker": "Thomas Haver",
            "bio": "Thomas Haver is presently serving as a Test Automation Architect. He leads a team of testers, ops engineers, and production support analysts in the adoption of DevOps practices. Previously, he led the enterprise automation support of 73 applications at Huntington National Bank that encompassed testing, metrics & reporting, and data management. Thomas has a background in Physics & Biophysics, with over a decade spent in research science studying fluorescence spectroscopy and microscopy before joining IT.",
            "title": "The Rise and Benefits of Robotic Process Automation",
            "abstract": "Robotic Process Automation (RPA) is a term given to technology that allows developers to programmatically emulate the actions of a human to execute a business process. RPA often operates on the user interface (UI) layer to capture data or interact with an application or across multiple applications to perform tasks that are considered repetitive or time-consuming. Originally focused on business processes, many RPA solutions now integrate with SDLC tools. While the promises of easy adoption and scaling are made by almost every vendor, the reality is long-term commitment to an RPA program is the same as any new application. In this presentation, the audience will learn about the benefits of RPA, multiple RPA use cases, and how RPA can be assimilated into a enterprise.",
            "time": "12:45 - 1:45",
            "room": "Great Hall 1 & 2",
            "website": "https://red-green-refactor.com/",
            "linkedin": "https://www.linkedin.com/in/thomas-haver/",
            "twitter": "https://twitter.com/COGSfun"
        },
        {
            "speaker": "Titus Fortner",
            "bio": "Titus Fortner is a core contributor to the Selenium project and the current project lead for Watir (a Ruby test library built on top of Selenium). Titus has created automated frameworks at several companies as an SDET and worked with numerous clients on their frameworks as a Solutions Architect at Sauce Labs. He's currently a Senior Development Experience Engineer, creating tools and resources for developers and testers to make better use of Sauce Labs.",
            "title": "The Valley of Success",
            "abstract": "While the industry is moving toward continuous delivery and continuous testing, most companies still struggle to maintain successful test automation suites. Many automated test efforts focus on the wrong things, and are structured in ways that make it too easy to fail.\n\nThis talk will walk through how to focus a testing strategy and organize testing code to get good value from test execution. In addition to big picture strategies, the talk will cover specific examples for how to obtain significant improvements in several different components of a test framework, including successful test writing, data management, page object abstractions and synchronization.",
            "time": "1:55 - 2:55",
            "room": "Cartoon Room",
            "website": "https://titusfortner.com/",
            "linkedin": "https://www.linkedin.com/in/titusfortner/",
            "twitter": "https://twitter.com/titusfortner",
            "linkedin2": "",
            "twitter2": "",
            "website2": ""
        },
        {
            "speaker": "Magesh Chandran",
            "speaker2": "James Otworth",
            "bio": "Magesh Chandran is QA Test automation architect at Everest technologies. An avid learner and practitioner of Test automation. He is passionate about Quality and is experienced with a variety of technologies and tools. Currently, leading QA automation with a client's transformation journey. Magesh is father to 2 amazing kids and loves outdoor sports.",
            "bio2": "James Otworth is a software developer and test engineer with a focus on quality. Transitioning from medical science to software in 2019, he has been responsible for automating performance, regression and functional testing for several teams and projects at Everest Technologies Inc. While at his current client Abercrombie & Fitch, he has been a key contributor in modernizing the current integrations platform, implementing CI/CD technologies and introducing future-state QA methodologies into the software delivery pipeline.",
            "title": "QA Strategy in Digital Transformation",
            "abstract": "Navigate digital transformation by targeting value-based tests with distributed tools that encourage adoption of modern testing patterns. Shift time-consuming tests left with a malleable QA approach and enable Agile teams to own quality. Discuss the full spectrum of testing methods and tools, including automation & performance testing strategies. Share testing implementation experience and challenges from our clients.",
            "time": "1:55 - 2:55",
            "room": "Great Hall 3",
            "website": "",
            "linkedin": "https://www.linkedin.com/in/mageshchandran/",
            "twitter": "",
            "linkedin2": "https://www.linkedin.com/in/james-otworth/",
            "twitter2": "",
            "website2": "",
            "youtube2": ""
        }
    ]
}