{
    "sessions": [
        {
            "speaker": "Anne Hungate",
            "bio": "Anne Hungate is a technology executive and entrepreneur who guides technology teams through exploration and evolution.  Anne is Head of Infrastructure and Operations for RTI International, an independent nonprofit research institute dedicated to improving the human condition.  Leading a global team of support an operations professionals, Anne is focused on ensuring the team meets the technology needs of projects that cover every corner of the planet. She is founder of Daring Systems, a consulting practice that drives productivity and profitability improvements through operational transparency. Anne is launching her second organization later this year – details to come!\n\nA mother of two teenage daughters, Anne spends her free time driving them to practices, cheering for them on the sidelines, and insisting they clean their rooms.  She and her husband Joe are fitness enthusiasts who make time to play tennis together and run an occasional race. Ohio natives, the Hungates currently live in Apex, NC after a three year stint in the Los Angeles area.  A risk taker and dedicated learner, Anne enjoys writing and attending/speaking at conferences.  She holds DevOps Foundation, DevOps Test Engineer, and professional coaching certifications, and has earned both Certified Software Quality Analyst and Project Management Professional designations.\n\nAnne earned her BS in Analytics from Miami University and her MBA from Case Western Reserve University.",
            "title": "Climbing out of the Box: Bringing Your Quality Career into the Digital Era",
            "abstract": "Deadlines, commitments, policies, and procedures are a few of the many things that are essential for teams and organizations to deliver and grow. But too often, these constructs become constraints on our thinking, our creativity, and our growth as individuals.  Today’s business climate requires fast-paced delivery and real-time interaction with customers; putting our own development second feels necessary for survival.\n\nJoin executive and entrepreneur Anne Hungate for a dynamic exploration of how we can drive satisfaction, career growth, and life balance by climbing outside of the box defined by our roles. A dedicated learner and willing risk-taker, Anne will share her story of applying her learning as a Quality professional to help organizations thrive, and provide real examples of others who have stepped outside of their roles to see the value a Quality mindset provides across organizations.\n\nThe Digital Era needs daring dedication to accuracy and customer experience – perfect conditions for Quality professionals to thrive… if they’re willing to climb out of the box!",
            "time": "4:15 - 5:15",
            "room": "East Ballroom",
            "picture": "",
            "website": "https://daringsystems.com/",
            "linkedin": "https://www.linkedin.com/in/annehungate/",
            "twitter": "https://twitter.com/annehungate"
        },
        {
            "speaker": "Paul Grizzaffi",
            "bio": "As a Principal Automation Architect at Magenic, Paul Grizzaffi is following his passion of providing technology solutions to testing, QE, and QA organizations, including automation assessments, implementations, and through activities benefiting the broader testing community. An accomplished keynote speaker and writer, Paul has spoken at local and national conferences and meetings. He is an advisor to Software Test Professionals and STPCon, as well as a member of the Industry Advisory Board of the Advanced Research Center for Software Testing and Quality Assurance (STQA) at UT Dallas where he is a frequent guest lecturer. In addition to spending time with his twins, Paul enjoys sharing his experiences and learning from other testing professionals; his mostly cogent thoughts can be read on his blog at at https://responsibleautomation.wordpress.com.",
            "title": "Testing Your Metal – Drawing Parallels Between Testing Concepts And Heavy Music",
            "abstract": "The phrase \"test your mettle\" means to test what one is made of, what one is prepared to endure. In both testing and automation development, we often have to endure suboptimal situations and difficult challenges such as unrealistic expectations, resistance to change, and an insistence that automation has to come from test cases.\n\nIn coping with these challenges, many people find solace in music; listening to and playing music can be a cathartic experience. Music, specifically titles and lyrics, can also be thought-provoking and motivating. Paul Grizzaffi, a self-proclaimed metalhead and rock-a-holic, is one of those people who is greatly affected by music. He not only has experience with testing and automation, he’s quite the aficionado of heavy music. His love of automation, testing, and music inspired the pun in the title.\n\nJoin us as Paul takes us on a tour of some impactful lyrics and song titles that frame memorable messages about testing and automation. Among the featured messages: we make our own expectations, automation is software development, and there are important business aspects related to automation and testing that cannot be ignored. \n\nTakeaways:\n• Find your friendlies; they can help evangelize your message\n• Automation does not replace testers; it does not have to come from test cases\n• Only automate if there is value, not just because of process.",
            "time": "8:00 - 9:00",
            "room": "East Ballroom",
            "picture": "",
            "website": "https://responsibleautomation.wordpress.com",
            "linkedin": "https://www.linkedin.com/in/paulgrizzaffi",
            "twitter": "https://twitter.com/pgrizzaffi"
        },
        {
            "speaker": "Alan Koch",
            "bio": "Alan S Koch has more than 40 years’ experience in information technology with a strong primary focus on software development and software quality, including Agile development and DevOps.  In the most recent 20 years, he has assessed and consulted with dozens of organizations, and coached and trained several thousand IT professionals in many different industries.\n\nIn addition to BS Mathematics and MS Management Science degrees, Alan has these certifications:\n• Project Management Institute’s PMP and PMI-ACP\n• Scrum Alliance’s Certified Scrum master\n• International Consortium for Agile’s ICP-TST, ICP-FDO, ICP-IDO\n• Axelos’s Certified ITIL Expert\n• SACA’s COBIT 5\n• Toast Masters International’s Certified Toast Master\n\nAlan is a prolific speaker, writer and contributor to advancing the IT professions, and the knowledge and capabilities of IT professionals.",
            "title": "The 5 Layers of Security Testing",
            "abstract": "\"Information Security: Everyone’s job every day\" (… and that includes testers!) Security is too important to ignore, so we will look at all of the ways that we as testers need to collaborate with our Security professionals and our developers to ensure that security is addressed well in our project’s testing and verifications.\n\nWe will first lay a foundation of security concepts and terminology.  Then we will walk through the 5 Layers of Security Testing and explore what is involved in doing a good job of each.\n\n1. Test Security Features.  We will start by looking at some of the security mechanisms our developers design into their code (e.g. encryption) and the ways we can collaborate with them to design good White-Box tests.  Then we will turn our attention to the various types of Security Requirements so we can ensure that our system testing of those requirements is adequate.\n\n2. Perform Negative Testing.  Not just for quality purposes, negative testing is also an important part of our security testing.  In this context, we will look at both white-box and black-box Fuzz Testing.\n\n3. Test Misuse and Abuse Cases.  To our consideration of Use Cases, we should add Abuse Cases and Misuse Cases – How might people abuse or misuse the system and how should it respond?\n\n4. Test for Common Bugs that open Vulnerabilities.  The mistakes the developers make that have the side-effect of opening security vulnerabilities are widely published and well known.  (Think buffer overflow.)  We will look at some to the best sources of this information and discuss how testers can collaborate with their developers to find those mistakes early.\n\n5. Ensure Readiness for Release.  We will look at the final verifications and testing that can confirm that the system is secure enough to release, including Penetration Testing.",
            "time": "12:45 - 1:45",
            "room": "Interfaith Room",
            "picture": "",
            "website": "https://aspetraining.com",
            "linkedin": "https://www.linkedin.com/in/AlanSKoch",
            "twitter": "https://twitter.com/AlanSKoch"
        },
        {
            "speaker": "Anita Uppalapati",
            "speaker2": "Joseph Beale",
            "bio": "Anita Uppalapati is the NF Quality Engineering Coach at Nationwide. She has led testing efforts on a range of programs and projects that are Tier 1 and Tier 2 such as Personal Lines Transformation Release 2.0, New Company, Goal State Underwriting, SmartRide, etc. She enjoys working with Application teams, listening and understanding their current testing challenges, identifying complex workflows that are manual intense by experimenting, designing and building innovative automation solutions that include risk-based testing and reusability that enable application teams to efficiently test E2E to help save time and money and deliver faster software releases.",
            "bio2": "Joseph Beale is a Lead Consultant for Tricentis who travels all over the country helping clients implement test automation and training them on the Tosca automation tool. Joe lives in Columbus and is one of the organizers for the QA or the Highway conference. Joe has over 20 years of experience in systems and has been focused on Test Automation since 2012.",
            "title": "Going Scriptless: Implementing Model-Based Test Automation in a Large Enterprise",
            "abstract": "Over the past year Nationwide Insurance has moved in the direction of using a scriptless model for automating their software testing with a tool called Tosca. Join us for a discussion of this topic with the following highlights:\n\nAnita Uppalapati of Nationwide will describe the journey, why they made this decision, and how it is being rolled out in waves.\n\nJoseph Beale of COSQAM will talk about the benefits of scriptless automation versus other methods and go deep into model-based automation using the Tosca tool.\n\nThere will also be a general discussion around how this type of test automation changes the nature of testing teams and contributes to the overall digital transformation process.",
            "time": "9:15 - 10:15",
            "room": "Great Hall 1 & 2",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/anita-uppalapati-40b258116",
            "linkedin2": "https://www.linkedin.com/in/josephbealeqa",
            "website2": "https://www.tricentis.com/",
            "twitter2": "https://twitter.com/JosephBealeQA"
        },
        {
            "speaker": "Andrew Griffin",
            "bio": "Andy is currently working as a Lead QA Automation Engineer. He graduated from The Ohio State University with a degree in Computer Science, and has subsequently worked at multiple large firms in Central Ohio. His experience includes leading testing teams updating legacy applications, building quality assurance tools and processes for teams from the ground-up, and architecting automation frameworks for a variety of application and technologies. In his spare time, Andy enjoys traveling, golfing, fantasy football, and probably-way-too-competitive kickball leagues.",
            "title": "Behind Your UI Scripts: So Much Room for (Network) Activities",
            "abstract": "Automated UI testing for web apps is commonly implemented across the industry, but concurrently tracking our applications’ network traffic is seen much less. We can squeeze more value out of our already existing automated UI scripts and, with just a little bit of extra effort, add another layer of potential validations that they can perform. The data that we extract can assist us in ensuring the integrity of the data we are sending, checking HTML responses for errors, or even tracking response times for performance. This session will cover some tools we can use to add network traffic monitoring to our tests, and the different types of uses we might have for this extra data.",
            "time": "1:55 - 2:55",
            "room": "Interfaith Room",
            "picture": ""
        },
        {
            "speaker": "Annie Bhaumik",
            "bio": "Annie is a Senior Performance Test Engineer at OCLC. She is passionate about performance testing and engineering. Prior to OCLC she worked in Cognizant Technology Solutions.She has led several performance testing engagements in Banking, Retail and Insurance companies to successful completion. Annie has expertise with performance testing, engineering, monitoring  and tuning Web, API, Cloud, Hadoop applications using an array of performance testing and Application Performance Monitoring (APM) tools in the Performance work space.",
            "title": "Need for Speed - \"How to Performance Test the right way\" ",
            "abstract": "Nobody likes a slow application. In today’s world most users abandon a website if it does not load within 3 sec ( based on Google’s research). Performance failures can cost millions of dollars to businesses. There is a tremendous need to performance test the right way. In this talk we will focus on how performance testing is beyond only load testing and how to design realistic performance tests. We will also talk about different types of performance tests and how they can identify specific weaknesses in the system and can prevent performance failures in production.",
            "time": "3:05 - 4:05",
            "room": "Interfaith Room",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/annie-bhaumik-01326424"
        },
        {
            "speaker": "David Laulusa",
            "bio": "David has worked at a variety of companies, both large enterprises and small startups. As a contractor and as an FTE. Mostly in Development but several years in QA. A few years ago when he started working at SAP, his boss handed him The Phoenix Project by Gene Kim and Continuous Delivery by Jez Humble and said, \"Read these and figure out this DevOps thing\".\n\nDavid has been a member of the DevOpsDays Columbus organizing committee since it’s inception. He’s also Co-Organizer of the DevOps Columbus Meetup.",
            "title": "Shift-Left Testing: QA in a DevOps World",
            "abstract": "As we try to shrink cycle times where does QA fit in this new paradigm? Are they the ugly step children that are left in the kitchen to eat only after development has finished the feast? And what of the start up that probably doesn’t even have QA?\n\nThis talk is aimed mainly at the Development and Operations folks who will have to wear the QA hat.\n\nDeming said ‘Inspection does not improve the quality, nor guarantee quality. Inspection is too late. The quality, good or bad, is already in the product. As Harold F. Dodge said, “You can not inspect quality into a product.”\n\nAnd Aristotle said, “Quality is not an act, it is a habit.”\n\nLarry Smith, in reference to ‘Shift Left Testing’ concept, said, \"Bugs are cheaper when caught young.\"",
            "time": "3:05 - 4:05",
            "room": "Student Alumni Room",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/davidlaulusa",
            "twitter": "https://twitter.com/dlaulusa"
        },
        {
            "speaker": "Deepika Achary",
            "bio": "Deepika Achary is a Test Engineer at OCLC. She joined OCLC in 2018 where she currently automates tests for big data technologies. She holds a bachelor’s degree in Electronics and Communications Engineering from Biju Patnaik University, India. She has a prior work experience as a test automation developer with Tata Consultancy Services. Some of her strengths are building and maintaining test automation frameworks. She has a knack towards problem solving and possesses great analytical skills. Deepika is trained in an Indian classical dance form called Odissi which she practices in her spare time and loves to paint.",
            "title": "A Glimpse of Test Automation in Hadoop Ecosystem",
            "abstract": "Big data is a buzzword that describes a huge volume of both structured and unstructured data that is huge and challenging to process using traditional software engineering techniques. This extensive data is processed through Hadoop ecosystem.\n\nWhile big data provides solutions to complex business problems, it poses bigger challenges in testing these scenarios such as effectively managing, maintaining and using the data. This makes testing big data applications different and significantly more complex than testing regular applications. Data is transferred and transformed among many services and needs to be validated at various transition points and processes such as data ingestion, data processing and data storage.\n\nWe will be focusing on how to interact with these components in a test automation framework:\n1. HDFS – Highly fault-tolerant distributed file system for processing large data sets.\n2. HBASE – Highly scalable non-relational database.\n3. KAFKA - A messaging system that lets you send messages between processes, applications, and servers.\n4. SOLR – Lucene based search platform.\n\nWe will demonstrate the processes and tools we have successfully implemented in our test automation. By using this automation approach, we have achieved faster feedback and low manual intervention during the testing process. This helped us a lot to do effective functional verification and getting accurate results. We will explore different ways and also share tips that can help every tester, new or seasoned, to understand how to use automation as part of testing the above-mentioned Hadoop ecosystem components.",
            "time": "1:55 - 2:55",
            "room": "Student Alumni Room",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/deepika-achary"
        },
        {
            "speaker": "Dennis Colburn",
            "bio": "Dennis is a test automation consultant who has been working at Sogeti since March 2017.  He spent most of his career as a software developer but was exposed to automated testing in 2011 while working at Nationwide Insurance.  He was intrigued by the new method of testing and has been striving to mature test automation in the data warehouse/ETL domains at every company he was worked with since.\n\nDennis grew up in Columbus and graduated with a B.S. in Mathematics from Ohio State.  He has 4 kids, a granddaughter, and a yellow lab named Jax.  In his spare time, Dennis likes to read, listen to music,  and play board games and table top rpgs with family and friends.  He is also learning to play the guitar and quickly learning that patience is a virtue in this endeavor.",
            "title": "Automated unit testing frameworks for ETL projects",
            "abstract": "One important characteristic of a “good” piece of software is that it is testable.  If you can’t test something, then how do you know it works?  How do you know that it still works when making future changes?\n\nI’ve been working in data warehouse environments for several years on ETL projects.  I’ve had success implementing automated testing in this domain, but one comment that hear frequently from ETL developers is “oh, you can’t test this Informatica workflow…it’s just too complicated…we don’t have data for that…”.  Well, I think the questions in the first paragraph still apply.  How do I know that my ETL process works if I can’t test it?\n\nIn this session we will focus on unit tests that are applicable in the ETL domain.  We will learn how to identify unit tests, how to setup these unit tests in your automated test framework, and how automating these tests might just change how you design your ETL processes.",
            "time": "10:30 - 11:30",
            "room": "Interfaith Room",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/dennis-colburn",
            "twitter": "https://twitter.com/denniscolburn"
        },
        {
            "speaker": "Eran Kinsbruner",
            "bio": "Eran Kinsbruner is the chief evangelist at Perfecto (a Perforce company) and the author of ‘The Digital Quality Handbook’ and ‘Continuous Testing for DevOps Professionals’, as well as a monthly columnist at the Enterprisers Project. He is a software engineering professional with nearly twenty years of experience at companies such as Matrix, Sun Microsystems, General Electric, Texas Instruments and NeuStar. He holds various industry certifications from ISTQB, CMMI, and others. Eran is a recognized mobile and web testing influencer and thought leader, as well as an experienced speaker in the major software engineering conferences. He is also a patent-holding inventor for a test exclusion automated mechanism for mobile J2ME testing, public speaker, researcher, and blogger. He can be found all over social media, including on Facebook, Twitter (@ek121268), LinkedIn, and his professional continuous testing blog – http://continuoustesting.blog",
            "title": "Enhancing your Test automation Scenario Coverage Using Selenium",
            "abstract": "Success in cross-browser test automation relies on many variables. Today’s reality forces practitioners within DevOps/Agile teams to join effort in assuring quality, removing risks, and releasing fast. To meet these goals, business testers, developers, and test automation engineers need to work together with the proper technology stack that matches their skillset. Join Perfecto’s Chief Evangelist and author, Eran Kinsbruner, in this session as he provides recommendations for high coverage, high reliability, and maintainability of cross-browser test automation. In this session, Eran will walk through the following topics: - Trends in cross-browser test automation. - Introduction to test automation using codeless and BDD Selenium tools. - The material differences between the three approaches: code-based Selenium, BDD, and codeless. Including a live demo of the various approaches.",
            "time": "10:30 - 11:30",
            "room": "West Ballroom",
            "picture": "",
            "website": "https://continuoustesting.blog",
            "linkedin": "https://www.linkedin.com/in/eran-kinsbruner-4b47a81"
        },
        {
            "speaker": "Ford Arnett",
            "bio": "Ford Arnett is an experienced full stack developer with several years in the automation space. He has created an automation department from the ground up, from building an automation lab to architecting several frameworks. Having worked with over a dozen clients impacting millions of users, all with varying QA automation needs, Ford employs a myriad of tools and tricks to help his team tackle all kinds of challenges. He also leads a monthly QA automation group in Dallas that has over 500 people.",
            "title": "I Can't Do That -- Using the Force To Unlock Your True Testing Potential",
            "abstract": "One of the most common questions asked in the QA space is \"How can I transition from a manual QA to a more automation focused or technical QA?\" Using his experience in leading his automation team, as well as teaching dozens of people with all ranges of technical experience, Ford will attempt to answer this question.\n\nWith countless tools to learn and seemingly never ending amount of testing types to master, it can be very intimidating to get started. There are numerous places to start depending on your passions, and what a tester would like to achieve. You don’t have to master five programming languages in order to write your first API test, and you don’t have to be a Selenium expert to create your first record and playback test. Much like you don’t need to be a Jedi to use the force, automation can be a powerful tool in your arsenal even if you are not an automaton master.\n\nJoin Ford Arnett as we go through a hypothetical automation journey, starting with self doubt and mental barriers to success then moving onto small wins and finally how to become a master of your chosen craft.​",
            "time": "12:45 - 1:45",
            "room": "Great Hall 1 & 2",
            "picture": ""
        },
        {
            "speaker": "Jeff Van Fleet",
            "speaker2": "Mark Adams",
            "bio": "THE GEEK: Jeff Van Fleet, President, Lighthouse Technologies\n\nAfter spending over 20 years managing, developing, and deploying complex software/hardware systems for both commercial and Department of Defense (DoD) applications, Jeff founded  Lighthouse in 2000 with the aim of establishing a company whose customer service was only eclipsed by the quality of its work.  Armed with an encyclopedic knowledge of motivational leadership tactics and a wealth of expertise in software quality assurance (QA) processes and technical leadership, he’s a both a hands-on company leader and the primary architect of Lighthouse’s celebrated workplace culture. Jeff is a proud graduate of Penn State University where he played the trumpet in the marching Blue Band.",
            "bio2": "THE COACH: Mark Adams, ESPN National College Basketball Analyst and VP of Client Success, Lighthouse Technologies\n\nFormer coach Mark Adams has been a national men’s college basketball analyst for ESPN since 1999. Adams is a real coach who develops strategies for IT teams struggling with leadership, communication, and teamwork. Previously, Adams enjoyed a 17-year college coaching career with a proven track record of rebuilding struggling programs. Between his three college head coaching jobs, those teams had a combined winning percentage of 34 percent (28-54) in the season before Adams took over. In his final season at each of the three universities, he led them to a combined 59-32 record, a 65 percent winning percentage, with two championships and Coach of the Year honors in 1989. He also held assistant coaching positions at Washington State University and Idaho State University, where he earned his master’s degree in athletic administration.",
            "title": "A Coach and a Geek:  How to Coach, Test, Measure and Build an Accountable Quality Team!",
            "abstract": "Mark Adams, ESPN's National College Basketball Analyst and VP of Client Success for Lighthouse Technologies and Jeff Van Fleet, President of Lighthouse Technologies combine their passion for coaching, testing, quality and team building in this unique, fun and interactive 60 minute presentation. Learn how a coach and a geek have joined forces to help IT teams effect change, drive better productivity, challenge the status quo and become better quality teams.",
            "time": "1:55 - 2:55",
            "room": "West Ballroom",
            "picture": "",
            "linkedin2": "https://www.linkedin.com/in/lighthouse-technologies-inc-b36a3559",
            "twitter2": "https://twitter.com/enthusiadams",
            "website2": "https://lighthousetechnologies.com",
            "linkedin": "https://www.linkedin.com/in/eran-kinsbruner-4b47a81",
            "website": "https://lighthousetechnologies.com",
            "twitter": "https://twitter.com/lighthousetechteam"
        },
        {
            "speaker": "Jenna Davis",
            "bio": "Jenna is currently an Automation Engineer for Encova Insurance located in Columbus, Ohio. She has over 3 years of experience in Quality Assurance including manual testing, production support testing, and primarily, performance testing. She currently holds the ISTQB Certified Testing Foundation Level certification. Jenna is also passionate about Diversity & Inclusion and currently is the Chair of Mosaic, the LGBTQ+ Associate Resource Group at Encova. Prior to her technology career, she worked in health care and recreation. She holds a Bachelor’s degree in Sport Management, Master’s degree in Recreation Studies, and an Associate’s degree in Computer Science. Jenna is proud of her diverse background and believes it aides in her success today as a Quality Assurance professional.",
            "title": "Why Diversity, Inclusion, and Representation is Necessary in Tech and Quality Assurance",
            "abstract": "We all have heard why diversity and inclusion is important to the success of any organization but that also applies to technology and quality assurance. In this session, we will go over the history of diversity in tech, go through examples of how some failures of technology could have been avoided if there was inclusion, and dial down on why specifically diversity & inclusion is important in Quality Assurance. We will discuss implicit biases and ways WE can make a change for the future!",
            "time": "10:30 - 11:30",
            "room": "Cartoon Room",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/jenna-davis-ctfl/",
            "twitter": "https://twitter.com/jennaljeffery"
        },
        {
            "speaker": "Andrew Birkholz",
            "bio": "Andrew is known for solving problems & challenges that no one has been able to resolve. He is a multi-dimensional, technology executive who love’s experimenting with the latest technology and creating software products that help people and companies. Andrew has experience speaking on stages across the United States and is very well respected in the space. He has consulted with hundreds of enterprises over the last 15 years from start-ups to the Fortune 500 companies and helped his clients implement test automation solutions on almost every platform you can think of including: TV's, cars, ships, game consoles, mobile phones, medical devices, multiple mobile applications, software and more. Using that experience, Andrew is now the Chief Technology Officer and Co-founded PinkLion.AI to introduce AI to app teams and help people utilize Artificial Intelligence in a way the benefits their day-to-day job.",
            "title": "Re-Shaping The Test Pyramid",
            "abstract": "In this session Andrew Birkholz will explore new shifts in testing paradigms. Demonstrate an AI first testing method that integrates with your current manual and automation testing, and understand AI that aids your app teams. Re-think where you want to spend time and money in your testing team in a challenge that plagues most companies of too much to test and too little time.\n\nThis will re-position the testing and quality organizations to not be the last part of what happens, but to providing valuable insights and actionable data for your C-Suite to drive business decisions.\n\nKey Takeaways:\n1. Ideas to reshape your test strategies\n2. An understanding of AI solutioning and where to begin implementing\n3. Analysis of available tooling options in the AI space. (Vendor agnostic)",
            "time": "3:05 - 4:05",
            "room": "West Ballroom",
            "picture": "",
            "website": "https://www.pinklion.ai",
            "linkedin": "https://www.linkedin.com/in/andrewbirkholz",
            "twitter": "https://twitter.com/abirky"
        },
        {
            "speaker": "Jerren Every",
            "bio": "Jerren is an Automation Developer supporting customer facing web applications. His scope of work includes: databases, Jenkins, services, desktop applications and web applications. Jerren additionally enjoys teaching others about coding and test-automation. Previously Jerren worked for Sogeti as a QA Analyst.",
            "title": "Automated ADA Testing with Pa11y and Ruby-Cucumber",
            "abstract": "Session Abstract: ADA compliance is a necessity to that is often a costly and time-consuming part of the software development process. This talk covers the story of how a company can move from manual ADA testing to automated ADA testing utilizing Pa11y and Ruby-Cucumber.\n\nSections include:\n• Background - Overview of ADA and how it pertains to software development. \n• Constraints - Limitations of traditional ADA testing ideologies.\n• Pa11y Overview - Discussion of how Pa11y is utilized as a standalone tool.\n• Integration - How to utilize Pa11y within a Ruby/Cucumber framework.\n• Pa11y Customization - How to customize Pa11y for a better end user experience.\n• Limitations - Constraints of current implementation of Pa11y.\n• Future Capabilities - Where we want to go in the future with ADA Automation.",
            "time": "10:30 - 11:30",
            "room": "Student Alumni Room",
            "picture": ""
        },
        {
            "speaker": "Jess Lancaster",
            "bio": "Jess Lancaster is the QA Practice Manager at TechSmith, the makers of Snagit, Camtasia, and other visual communication software applications. He has over 18 years of testing and test leadership experience with government, financial, insurance, and commercial software organizations. Jess regularly speaks on software development and testing at meetups and conferences. He has served as adjunct faculty for software testing at Lansing Community College and is the co-founder of Lansing Area Software Testers.",
            "title": "Dazzling Dashboards on the Double: 60 minutes to your first Information Radiator",
            "abstract": "Making actionable information visible to your team can drive discussion, improve products, and influence behavior. You want to take steps to improve quality awareness on your team, but don’t know where to begin? Start by using telemetry to engage your team in facing and solving real problems! Walk away from this session with some ideas of what to measure and some tools to build your own information radiator in less than an hour!\n\nIn this session you will walk away with:\n• The types of telemetry you and your team should consider monitoring\n• The benefits an information radiator can have on your team\n• How to set up quick and easy information radiators for your team using free tools and data you already have\n• Challenges and successes we encountered launching information radiators at TechSmith",
            "time": "12:45 - 1:45",
            "room": "West Ballroom",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/jesslancaster",
            "twitter": "https://twitter.com/jessclancaster"
        },
        {
            "speaker": "Joel Montvelisky",
            "bio": "Joel Montvelisky is a Co-Founder and Chief Solution Architect at PractiTest. He has been in testing and QA since 1997, working as a tester, QA Manager and Director, and a Consultant for companies in Israel, the US and the EU. Joel is also a blogger with the QA Intelligence Blog, and is constantly imparting webinars on a number of testing and Quality Related topics.  Joel is also the founder and Chair of the OnlineTestConf, and he is also the co-founder of the State of Testing survey and report.  His latest project is the Testing 1on1 podcast with Rob Lambert. Joel is also a conference speaker, presenting in various conferences and forums world wide, among them the Star Conferences, STPCon, JaSST, TestLeadership Conf, CAST, QA&Test, and more.",
            "title": "Let's focus more on Quality and less on Testing",
            "abstract": "What value do you provide to your company?  Testing never has value in itself, testing is a service we provide to our teams so that our company can provide value adding products or services.\n\nToday, due in part to the evolution of development practices and in part due to the adoption of new technologies, engineers who had the exclusive role of being Testing Professionals can now expand their value towards Quality Engineering in the broader sense of the word.\n\nIn this talk we will briefly review the forces pushing forward the changes in the way we write and deliver products today.  We will map the way a traditional tester might fit into this new reality. Then we will explore in depth the additional responsibilities we need to  take as testers in order to provide more value to our organizations as Quality Engineers.\n\nSome of these points have been developed by Alan Page and Brent Jensen as part of the Modern Testing (MT) principles, you can read more about them here - http://moderntesting.org\n\nA large number of data, showing the progress of testing comes from our annual State of Testing Survey and Reports, available here - https://qablog.practitest.com/state-of-testing/\n\nMany of the ideas for the future roles and responsibility of testers come from observations and conversations with hundreds of testing organizations around the world, that I have as part of my role.",
            "time": "12:45 - 1:45",
            "room": "Cartoon Room",
            "picture": "",
            "website": "https://qablog.practitest.com",
            "linkedin": "https://www.linkedin.com/in/joelm3",
            "twitter": "https://twitter.com/joelmonte"
        },
        {
            "speaker": "Josh Grant",
            "bio": "I'm Josh Grant, a test automation specialist with nearly a decade of work experience in test automation. I've worked with desktop UI automation, unit testing, integration testing and Selenium-based testing with several languages and tools. Currently I am a Solution Architect for Sauce Labs (www.saucelabs.com), helping customers solve their pressing test automation problems and helping teams succeed with test automation. I currently live in Toronto, Ontario, Canada.",
            "title": "PyTest - The Awesome Parts",
            "abstract": "Python is a popular language for development, but it's also a great choice for test automation. Here I'll discuss some great plugins and features of PyTest, a Python-based test runner and framework. I'll show how these tools are helpful for Python developers but also why they encourage good test automation approaches and patterns.",
            "time": "1:55 - 2:55",
            "room": "Great Hall 1 & 2",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/josh-grant-9570a214",
            "twitter": "https://twitter.com/joshin4colours"
        },
        {
            "speaker": "Joshua Russell",
            "bio": "Josh is a test automation developer with experience automating web, desktop, mainframe, mobile, and more.",
            "title": "Fictional Test Data",
            "abstract": "Test data can tell a story at a glance. Most stories are obvious, like users in the QA5 environment with email addresses registered at qa5.com. There is an immediate value in the obvious stories; familiar conventions reveal the intent behind the data and make it easier to recognize and remember. What value can be attributed to stories that are more whimsical and nuanced? Let's talk about Noah Count, the user who never registered, and Maury Wards, who maximizes the loyalty points system. Let's look at the many stories that can be told by test data and turn fake information to fiction.",
            "time": "9:15 - 10:15",
            "room": "Interfaith Room",
            "picture": "",
            "twitter": "https://twitter.com/russelljoshuaa"
        },
        {
            "speaker": "Kelsey Shannahan",
            "bio": "Kelsey Shannahan is a senior developer at CoverMyMeds.  Her testing background has given her a different perspective in how to approach building software, specifically how testing should make our lives easier, not harder.  She develops primarily in Ruby with some Elixir because Elixir is really cool.",
            "title": "End-to-End Testing with Docker",
            "abstract": "Containerization is an efficient way to run applications on your local machine.  By linking containers together we can reproduce our application stack right on our local machines for use with both development and testing.  This talk will cover the basics of Docker and networking, as well as a brief introduction to using Traefik to manage containers.  No more having to fight over limited testing servers!",
            "time": "3:05 - 4:05",
            "room": "Great Hall 1 & 2",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/kelsey-shannahan-80568b71"
        },
        {
            "speaker": "Kenny Gilles",
            "bio": "Originally from Sweden, Kenny Gilles has spent the last six years in Stockholm and Columbus working as a QA/QC and Front-End Engineer. Working on a multitude of customer-facing projects at Klarna, an online payments company, he has designed and implemented a handful of automation libraries and pipelines. Throughout the years he has seen and heard about the obstacles people with disabilities face every day while browsing the web, and from that Kenny has grown more and more passionate about the topic and about spreading the good word of accessibility.",
            "title": "Ensuring Accessibility",
            "abstract": "I'm sure you sometimes bump into weird bugs in the wild. Ugly websites and strange UI/UX that just does not make any sense. Your reaction would probably be: \"Heh, I would've found that before it reached production.\". And then you move on to finish whatever task you were working on.\n\nThis is unfortunately not the case for everyone. Every day millions of people with disabilities are blocked from using a website or widget because of something minor or even unnoticeable to the majority of users. Society has been hard at work trying to make our physical world accessible to all, but we spend just as much time in the digital world and should consider it to the same extent.\n\nKeeping accessibility in mind throughout the development process, and especially in the testing phase(s), is integral to allowing everyone to use and interact with the web.\n\nI'll showcase examples of inaccessible widgets, how we can make them accessible and what tools are out there for us to use when testing, analyzing, and reporting on just how accessible our projects really are.",
            "time": "9:15 - 10:15",
            "room": "Student-Alumni Room",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/kenny-gilles/"
        },
        {
            "speaker": "Max Saperstone",
            "bio": "Max Saperstone has been working as a Software and Test Engineer for over a decade, with a focus on Test Automation within the CI/CD process. He specializes in open source tools, including the Selenium Tool Suite, JMeter, AutoIT, Cucumber, and Chef. Max is the Director of Test and Automation at Coveros, where he works as a test strategist and architect; he works with organizations to determine how best to test the application across the organization to ensure high quality and low risk releases. He currently heads up the development of Selenified, an open sourced testing framework to allow testing of multiple interfaces, custom reporting, and minimal test upkeep.\n\nIn addition to working heavily under the testing umbrella, Max is also an experienced Agile developer, and he is well versed in Agile processes and practices. He is an ICAgile Certified Professional (ICP). Max has spoken at multiple conferences including STARCanada, STAREast, Mobile Dev and Test, and AgileDC, and is currently an instructor for several courses.",
            "title": "Getting to Continuous Testing",
            "abstract": "Max will tell the story of how a healthcare company striving to get to continuous releases built up their automation to secure confidence in regular releases. Initially, as no test automation existed, Max was able to take a greenfield test automation opportunity, and in the span of 12 months, develop over 2000 test cases. A testing pipeline was created to verify the integrity of the automated test cases, and to build docker containers for simple execution of the tests. These containers could then be simply re-used by developers and the DevOps team to verify the application. Max will walk through the feedback loop created, which allowed verification of the application go from hours to minutes.\n\nMax will discuss what processes and paths were taken to achieve continuous testing on this project. While he will cover the tools used and why they were chosen, the main focus will be on the HOW and WHY certain patterns and activities were performed. These choices were critical to achieving continuous testing, rather than just good testing coverage in CI or CD, even allowing a push left for performance and security. Additionally, some time will be spent on the organizational and culture changes that occured, and how he was able to accomplish this push for adoption in an organization that resisted automation, and had major quality problems.",
            "time": "1:55 - 2:55",
            "room": "Cartoon Room",
            "picture": "",
            "website": "https://www.coveros.com/",
            "twitter": "https://twitter.com/Automate_Tests",
            "linkedin": "https://www.linkedin.com/in/maxsaperstone"
        },
        {
            "speaker": "Mohamed Maktoum Yoosuf",
            "bio": "An ambitious, innovative, and hardworking IT professional with a proven track-record of guiding teams across some of the largest & leading IT service providers across multiple industries within the US, Canadian, European, and Scandinavian markets.",
            "title": "Quality Engineering Transformation - Open Source",
            "abstract": "As a company, how much do you decide to spend on software? And what if I say you can cut your budget unbelievably if you get to eliminate licensed tools and by using open source tools as it is and modifying them accordingly? That is what exactly we did at Sysco, a global leader in selling, marketing, and distributing food products.\n\nMoving on to the story how a real fortune is saved, Our open source transformation was started back in 2017. By that time, almost all tools associated with quality engineering were commercialized tools. Less than three years, we have transformed a 95% QE tools usage to open source.\n\nIn this transformation, a QE platform has been built in house using the open-source. The beauty of the platform is that it supports the test scripting,  execution, reporting and results analysis.  Also, the platform caters functional and non-functional test and various OSs such as Linux, Windows, Mac and AS400 and tech stacks such as Java, NodeJS, .Net and Cobolt.\n\nThe platform has been used in the more than 50 products development teams and across globally such North America, Europe and Asia.",
            "time": "12:45 - 1:45",
            "room": "Student Alumni Room",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/mohamed-maktoum-yoosuf-b8790718"
        },
        {
            "speaker": "Patrick Poulin",
            "speaker2": "Sangit Patel",
            "bio": "Patrick started his tech career on mobile, and soon was managing the retail vertical for a company building the first mobile websites for over 75 major brands such as Tesco, Target, Macys, and MAC Cosmetics. After a (thankfully) short stint in adtech, he became the API Evangelist for Getty Images. This is where he first recognized the lack of good API tools. That experience is what led to the creation of API Fortress with his cofounder.",
            "bio2":"Sangit Patel is an engineer by trade, but after some time in the adtech industry he saw an opportunity to shift towards a more client facing role. In doing so, he realized his passion for bridging the technical side with the business side. That has brought him where he is today - as Sales Engineer with API Fortress, Sangit works with clients and business partners to improve their API testing and explore all that API Fortress can provide.\n\nSangit is an avid traveler and seeks to check off only 2 more continents from his travel list. He's also had a lifelong passion for music and enjoys playing clarinet and viola in his free time. ",
            "title": "Evolving API Testing into API Monitoring",
            "abstract": "Today many companies are switching to CI/CD & agile workflows, with the goal of continuously making releases. That aim for continuous integration and deployments is now pushing closer to constant. Learn pointers and tricks from companies with large and successful internal API programs.\n\nLearn...\nHow to write a smarter test.\nHow to use dynamic data to improve test coverage.\nCommon mistakes made when creating functional tests.\nHow to leverage any test into a functional uptime monitor.",
            "time": "3:05 - 4:05",
            "room": "Cartoon Room",
            "picture": "",
            "website": "https://apifortress.com",
            "linkedin": "https://www.linkedin.com/in/patrickrpoulin",
            "website2": "https://apifortress.com"
        },
        {
            "speaker": "Raj Subrameyer",
            "bio": "Raj is the Principal Consultant at ChaiLatte Consulting. He helps developer tools and/or services companies build awareness, increase organic website traffic, and generate leads through content creation and social influencer marketing. He also provides test consulting and training to make people and processes more effective.He actively contributes thought leadership and enrichment to the software community through conference talks, contributed articles, blogs and youtube videos, where he shares development,testing, leadership and productivity experiences gained through various development projects. You can read Raj’s expertise on his personal website www.rajsubra.com. He can be reached at raj@rajsubra.com, or follow him on twitter - @epsilon11.",
            "title": "How to develop and test AI Based Systems",
            "abstract": "A recent study conducted by Gartner, shows that by 2020, AI will be pervasive in almost all software products and services. The major highlight of the study was how our skills as engineers would have to adapt accordingly. The current roles in companies are going to change significantly and we need to be prepared for it.  The working of AI is a black box-- we do not control or understand how the algorithm forms different relationships and makes decisions -- we just provide different training datasets and monitor the learning/progress. We are trying to make predictions on future values based on learning from past examples, or trying to discover different patterns from datasets.\n\nCome attend this session where, I discuss the basics of how AI based systems work, what are the key factors to consider when developing and testing these systems and how to come up with an enterprise wide strategy. Finally, I will answer some common questions surrounding AI and also show what are some of the tools available for doing AI based development and testing. This session will help anyone get an understanding of the fundamentals of developing and testing AI based systems.",
            "time": "9:15 - 10:15",
            "room": "West Ballroom",
            "picture": "",
            "website": "http://www.rajsubra.com/",
            "linkedin": "https://www.linkedin.com/in/rajsubra/", 
            "twitter": "https://twitter.com/epsilon11"
        },
        {
            "speaker": "Richard Strang",
            "bio": "Richard Strang has 25 years of software quality assurance experience. He considers himself a professional tester. Starting in the test automation tools space immediately after university graduation, he has worked with a broad array of organizations as a tester, QA Manager, QA Architect, QA Process Specialist, & QA Guild Leader. Richard has been CSTE certified since 2011. While he thinks he has something valuable to share, he also looks forward to learning much more from the other presenters and attendees.",
            "title": "Overcoming Cognitive Dissonance: How to Effectively Deliver Unbelievable Test Results",
            "abstract": "Cognitive Dissonance is the mental discomfort experienced by a person who attempts to hold two or more contradictory beliefs, ideas, or values. As testers, we are often in the position of inducing cognitive dissonance in our stakeholders when we present them with evidence that their system is not ready for production, when they were confident that everything was on track and going well. So how can we present \"unbelievable\" test results in a way that will not only convince our audience but also spur them to take the steps required to bring their project back to a \"believable\" state? In this presentation, Richard will explore several techniques for presenting test results that will educate and enlighten the recipients, without any danger of causing mental distress.",
            "time": "",
            "room": "",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/richardstrang",
            "twitter": "https://twitter.com/richardstrang1"
        },
        {
            "speaker": "Richard Douglass",
            "bio": "Richard is a User Experience Consultant. For over 15 years he has helped create engaging experiences for companies such as IBM, Razorfish, and PwC. He has worked on a range of projects: Intranet, Extranet, .com, Mobile, and Enterprise and Development software. In addition, Richard has experience with a range of methodologies including: co-creation and strategy workshops, usability testing, interaction design, and persona development. In addition he has led workshop at conferences in China, New Zealand, and the United States.",
            "title": "Co-Creation Workshops: What Role Do They Play?",
            "abstract": "Co-Creation workshops are becoming more prevalent in the product lifecycle. Typically, they are employed early on in the discovery process. Attendees will learn more about Co-Creation workshops: what they are, who is involved, what outputs / deliverables to expect, and how QA professionals can best make use of them.​",
            "time": "9:15 - 10:15",
            "room": "Cartoon Room",
            "picture": "",
            "website": "https://improvedusability.com",
            "linkedin": "https://www.linkedin.com/in/richarddouglass1"
        },
        {
            "speaker": "Robert Fornal",
            "bio": "Husband, father, and ... programmer (senior developer). My focus is on front-end development: JavaScript, CSS, SVG, AngularJS and Angular, React, Ionic\n\n\"Learning from my mistakes over the decades, I feel that I have become a solid programmer.\" -- Me",
            "title": "A Lifecycle Of Code Under Test",
            "abstract": "When thinking about tests against code, have you \"done enough?\" How do you know that the code is covered appropriately, that odd bugs aren't going to crop up? Did you cover all the use cases and what if someone changes the code down-the-road?\n\nThis session is about the unit and integration tests that a developer writes to test their code immediately, not about higher level tests that are written by a QA individual or department.\n\nThis session will examine the code and tests holistically against the various lifecycle stages of code and how the testing needs to adjust:\n• Define Inputs and Outputs\n• Write Initial Test Coverage\n• Handling Bug Coverage\n• Refactoring\n• Abstraction\n• Future Work (how are tests affected?)",
            "time": "9:15 - 10:15",
            "room": "Great Hall 3",
            "picture": "",
            "website": "http://www.leadingedje.com",
            "linkedin": "https://www.linkedin.com/in/rfornal",
            "twitter": "https://twitter.com/rfornal"
        },
        {
            "speaker": "Ryan Quellhorst",
            "bio": "Ryan Quellhorst has been leading test teams and testing software for the last 5+ years. He is a BA/QA at Deep Lens where he's working on solutions that identify cancer patients for clinical trials. Outside of the office, he loves spending time with his wife and kids, traveling, running, golfing, and rocking out in the car to 90s music.\n\nHe also created the app that you are using right now.",
            "title": "Automating the Unknown - A journey of automating external applications",
            "abstract": "2 years ago my son started attending daycare, and I started using the daycare’s app that would let me see videos and pictures of my son. Over those two years they’ve amassed over 1,000 photos of my son. To download all of these pictures manually would take me hours on hours of time; not to mention he still has 4 more years of daycare and my daughter has started attending this year. I knew there had to be a better way.\n\nFollow me on my automation journey as I show you some tips, tricks, and stumbling blocks that I uncovered while trying to preserve my children’s memories.",
            "time": "10:30 - 11:30",
            "room": "Great Hall 3",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/ryanquellhorst"
        },
        {
            "speaker": "Thomas Haver",
            "bio": "Thomas is presently serving as Manager for Validation & Delivery. He leads a team of testers, ops engineers, and production support analysts in the adoption of DevOps practices. Previously, he led the enterprise automation support of 73 applications at Huntington National Bank that encompassed testing, metrics & reporting, and data management. Thomas has a background in Physics & Biophysics, with over a decade spent in research science studying fluorescence spectroscopy and microscopy before joining IT.",
            "title": "The Automation Firehose: Be Strategic and Tactical",
            "abstract": "The widespread adoption of test automation has led to numerous challenges that range from development lifecycle integration to simple scripting strategy. Just because a scenario CAN be automated does not mean it SHOULD be automated. Teams that adopt automation often rush to automate everything they can -- the automation firehose. For those scenarios that should automated, every team must adopt an implementation plan to ensure value is derived from reliable automated test execution. In this session, the audience will learn how to automate both strategically and tactically to maximize the benefits of automation. Entry criteria will be demonstrated for automation in the development lifecycle along with a set of checks to determine automation feasibility & ROI.",
            "time": "12:45 - 1:45",
            "room": "Great Hall 3",
            "picture": "",
            "linkedin": "https://www.linkedin.com/in/thomas-haver",
            "twitter": "https://twitter.com/cogsfun"
        },
        {
            "speaker": "Brian Brady",
            "bio": "Brian is a test automation specialist a mabl. A technology enthusiast - interested in open source, DevOps, and microservices. Brian loves history, guitar, and exploring the city of Boston in his free time.",
            "title": "The Era of Intelligent Testing: How Machine Intelligence is Shaping Future of QA",
            "abstract": "Traditional testing isn't keeping pace with the speed of DevOps and Continuous Delivery, but hope is not lost; AI will be used to make testing faster and more accessible to all.\n\nExisting QA solutions were built for a world where software changed infrequently. Highly adopted tools such as Selenium, Appium, and JUnit require a specialized skillset, and require too much maintenance once you start factoring in the brittle nature of tests, and the infrastructure required to run tests at scale. But there is still hope for QA in machine intelligence. Next-generation ML tools are here to help QA keep up with the agility of modern software delivery practices. You'll learn what ML strategies are being employed to make this possible, and what the future of QA - intelligent testing - looks like.\n\nTakeaways:\n•An overview of the QA tooling and vendor landscape\n•Demystifying the buzzwords - what machine intelligence in testing means today and tomorrow\n•How implementing DevTestOps can help increase test coverage and improve product quality",
            "time": "1:55 - 2:55",
            "room": "Great Hall 3",
            "website":"https://www.mabl.com/"
        },
        {
            "speaker": "Srini Raghavan Ramesh",
            "bio": "Srini is an accomplished Quality Analyst with over 10 years of experience in the IT industry. He offers creative problem-solving skills with a robust experience of working in Devops environments, developing test automation frameworks and testing related to WMS. He enjoys the synergies of proving concepts, team working and collaboration, as well as learning.",
            "title": "Dev(QA)Ops Journey",
            "abstract": "DevOps is inconceivable without QA. In this presentation, the role of \"QA\" in \"Devops\" world will be discussed and real time project examples will be provided.\n\nNo one likes to witness bugs seeping into production, leading to innumerable issues and wasteful expenditure. At the same time, business teams can ill-afford to wait for months on end to test and release their new features into the hands of ever-demanding customers. This is why many teams have now come to embrace Devops & Agile, as their go to. DevOps represents a significant change and plays a vital role in calling for testing at frequent intervals in a more automated fashion. QA teams have a huge place in a DevOps environment and all it requires is some adaptation and a sound DevOps testing strategy. In traditional approaches, QA has effectively played the role of a gatekeeper for many successful software deliveries, but in a DevOps environment, QA plays a pivotal role in thinning the boundaries among various teams leading to faster deliveries. Traditionally, the role of QA is to detect defects, but in the DevOps age, the prime responsibility of QA team will be more on preventing defects than finding them. This approach, not only helps “speed to market” but also helps in shortening the feedback cycle. ",
            "time": "3:05 - 4:05",
            "room": "Great Hall 3", 
            "linkedin": "https://www.linkedin.com/in/srinivasa-raghavan-ramesh-706317b7/"
        },
        {
            "speaker": "Shiva Agolla",
            "speaker2": "Mike Buening",
            "bio": "Shiva has lead large Digital Transformation, Automation and Quality Engineering, developed and implemented Quality methodologies, embedding Cognitive QA into the solutions and built and led diversified teams. At Sogeti, he enables clients gain efficiencies in their quality practices while increasing the overall quality of the product through increased automation with agility. He provides forward thinking leadership to large teams, guides the vision, plan, and implementation of quality engineering programs for enterprises and clients across the State as well Nationally. Shiva lives in Columbus.",
            "bio2": "Mike is a Director in the Digital Assurance & Quality Engineering practice with Sogeti. He has over 22 years’ experience in IT serving a variety of roles including business analyst, test lead, project manager, QA manager, program manager, and department head responsible for development, testing, and operations of information systems to a global audience. His experience includes working with chemical information systems, patent information systems, search engine development, non-profit business, and public utilities. He lives in central Ohio with his wife, three kids, and two dogs.",
            "title": "New rules for smarter and faster testing",
            "abstract": "The World Quality Report is the only global report analyzing software testing and quality engineering trends. It presents an analysis of developments in agile and DevOps, artificial intelligence, automation, test environments, data, security and budgets, showing once again the importance of quality, and of the measures that are put in place to maintain it with sector focus. The 11th Edition of this report captures insight from interviews with 1,725 CIOs and senior technology leaders from 32 countries and 10 industries.\n\nPresentation:\n•Artificial Intelligence can make testing smarter – but broader QA skills are needed\n•Test automation cannot keep pace with the demand for rapid development\n\nPanel:\n•Elite local panel discussion on the trends that are more pertinent for us here in Central Ohio\n\nLink to The World Quality Report https://www.sogeti.com/explore/reports/world-quality-report-2019/",
            "time": "10:30 - 11:30",
            "room": "Great Hall 1 & 2",
            "linkedin": "https://www.linkedin.com/in/shivaagolla",
            "linkedin2": "https://www.linkedin.com/in/mikebuening"
        }
    ]
}